app/controllers/posts_controller.rb

SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"
---
  def new
    # @post = Post.new
    # @post = Post.new(author_id: params[:author_id])
    if params[:author_id] && !Author.exists?(params[:author_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "author_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "By Author_id #IDK????"], ["author_id", 5], ["updated_at", "2019-09-24 21:37:31.343153"], ["id", 17]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)